# ExtendIntoWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FootPrintRoof..::..ExtendIntoWall Property
FootPrintRoof Class See Also
---
Retrieve or set whether extend into wall the curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool this[
	ModelCurve pCurve
] { get; set; }
```

Visual Basic
---
```text
Public Property ExtendIntoWall ( _
	pCurve As ModelCurve _
) As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExtendIntoWall[ModelCurve^ pCurve] {
	bool get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, bool value);
}
```

# ### Parameters
pCurve
    Type: Autodesk.Revit.DB..::..ModelCurve
# Remarks
Only applicable when the FootPrintRoof is created with Pick Walls.
# See Also
FootPrintRoof Class
Autodesk.Revit.DB Namespace